# pandas with mysql

In [181]:
import numpy as np
import pandas as pd
import mysql.connector

In [182]:
detail={
    "username":"admin",
    "password":"admin",
    "database":"pandas_test",
    "host":"localhost"
}
conn=mysql.connector.connect(**detail)
mysql_df=pd.read_sql("select * from employees", conn)
mysql_df.set_index('id', inplace=True)
mysql_df.loc[1]

nama                    andi
email    andi@purwadhika.com
waktu    2019-12-09 09:29:15
Name: 1, dtype: object

### cara kedua buat konek ke db

In [183]:
from sqlalchemy import create_engine

engine=create_engine("mysql://admin:admin@localhost:3306/pandas_test")
# connection=engine.raw_connection()

# DBAddress="mysql://admin:admin@localhost:3306/pandas_test"
mysql_df=pd.read_sql("select * from employees", engine)
# mysql_df.set_index('waktu', inplace=True)
mysql_df

   id  nama                email               waktu
0   1  andi  andi@purwadhika.com 2019-12-09 09:29:15
1   2  budi  budi@purwadhika.com 2019-12-09 09:29:15
2   3  caca  caca@purwadhika.com 2019-12-09 09:29:15
3   4  euis  euis@purwadhika.com 2019-12-09 09:29:15
4   5  fifi  fifi@purwadhika.com 2019-12-09 10:52:45

In [184]:
index=pd.date_range('20190105', periods=6)
# mysql_df.set_index(index, inplace=True)
# mysql_df.unstack()
mysql_df.stack()

0  id                         1
   nama                    andi
   email    andi@purwadhika.com
   waktu    2019-12-09 09:29:15
1  id                         2
   nama                    budi
   email    budi@purwadhika.com
   waktu    2019-12-09 09:29:15
2  id                         3
   nama                    caca
   email    caca@purwadhika.com
   waktu    2019-12-09 09:29:15
3  id                         4
   nama                    euis
   email    euis@purwadhika.com
   waktu    2019-12-09 09:29:15
4  id                         5
   nama                    fifi
   email    fifi@purwadhika.com
   waktu    2019-12-09 10:52:45
dtype: object

In [185]:
# mysql_df.to_sql(name='test', con=engine ,if_exists='replace')
mysql_df

   id  nama                email               waktu
0   1  andi  andi@purwadhika.com 2019-12-09 09:29:15
1   2  budi  budi@purwadhika.com 2019-12-09 09:29:15
2   3  caca  caca@purwadhika.com 2019-12-09 09:29:15
3   4  euis  euis@purwadhika.com 2019-12-09 09:29:15
4   5  fifi  fifi@purwadhika.com 2019-12-09 10:52:45

In [186]:
new_data=pd.DataFrame([{
    "id":11,
    "nama":"Farida",
    "email": "farida@purwadhika.com",
    "waktu": "2019-02-10 10:22:55"
},{
    "id":12,
    "nama":"Riko",
    "email": "riko@purwadhika.com",
    "waktu": "2018-02-10 10:22:55"
}
])
print(new_data.dtypes) #tipe waktunya object
print("")
new_data['waktu']= new_data['waktu'].astype('datetime64')
print(new_data.dtypes) #tipe waktunya object
mysql_df2=pd.concat([mysql_df,new_data])
# mysql_df2=pd.read_sql_query('select * from employees', engine, parse_dates=['waktu'])
mysql_df2.set_index('waktu', inplace=True)
mysql_df2

id        int64
nama     object
email    object
waktu    object
dtype: object

id                int64
nama             object
email            object
waktu    datetime64[ns]
dtype: object

                     id    nama                  email
waktu
2019-12-09 09:29:15   1    andi    andi@purwadhika.com
2019-12-09 09:29:15   2    budi    budi@purwadhika.com
2019-12-09 09:29:15   3    caca    caca@purwadhika.com
2019-12-09 09:29:15   4    euis    euis@purwadhika.com
2019-12-09 10:52:45   5    fifi    fifi@purwadhika.com
2019-02-10 10:22:55  11  Farida  farida@purwadhika.com
2018-02-10 10:22:55  12    Riko    riko@purwadhika.com

In [187]:
mysql_df2['2019']

                     id    nama                  email
waktu
2019-12-09 09:29:15   1    andi    andi@purwadhika.com
2019-12-09 09:29:15   2    budi    budi@purwadhika.com
2019-12-09 09:29:15   3    caca    caca@purwadhika.com
2019-12-09 09:29:15   4    euis    euis@purwadhika.com
2019-12-09 10:52:45   5    fifi    fifi@purwadhika.com
2019-02-10 10:22:55  11  Farida  farida@purwadhika.com

In [188]:
mysql_df2['2018']

                     id  nama                email
waktu
2018-02-10 10:22:55  12  Riko  riko@purwadhika.com

In [189]:
dfk=pd.read_csv('misc/TLKM.JK.csv', parse_dates=['Date'])
df=pd.read_csv('misc/TLKM.JK.csv', parse_dates=['Date'])
print(df.dtypes)
df.set_index('Date', inplace=True)
print(df['2019-08'][df['2019-08']['Close'] == df['2019-08']['Close'].max()])
print("")
# print(df.tail())

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object
              Open    High     Low   Close  Adj Close     Volume
Date
2019-08-20  4350.0  4470.0  4340.0  4470.0     4470.0  143171600

In [190]:
df['2019-07':'2019-11'].resample('W').sum() # =====> menampilakn perminggu

               Open     High      Low    Close  Adj Close     Volume
Date
2019-07-07  21050.0  21270.0  20940.0  21240.0    21240.0  319470400
2019-07-14  21330.0  21510.0  21150.0  21360.0    21360.0  327990200
2019-07-21  21220.0  21360.0  21120.0  21260.0    21260.0  250592700
2019-07-28  21060.0  21230.0  20860.0  21070.0    21070.0  294274800
2019-08-04  21250.0  21440.0  21120.0  21330.0    21330.0  495605500
2019-08-11  21060.0  21270.0  20760.0  20940.0    20940.0  510733300
2019-08-18  21390.0  21510.0  21150.0  21370.0    21370.0  374613300
2019-08-25  21920.0  22210.0  21680.0  22050.0    22050.0  523624700
2019-09-01  21900.0  22090.0  21740.0  21910.0    21910.0  474760800
2019-09-08  21840.0  21960.0  21510.0  21580.0    21580.0  387642900
2019-09-15  21330.0  21360.0  21020.0  21120.0    21120.0  352128900
2019-09-22  21160.0  21380.0  21030.0  21240.0    21240.0  435156000
2019-09-29  21250.0  21510.0  21060.0  21350.0    21350.0  375674800
2019-10-06  21370.0  21530.0  21020.0  21150.0    21150.0  314332800
2019-10-13  20660.0  20870.0  20390.0  20600.0    20600.0  253304700
2019-10-20  20890.0  20960.0  20740.0  20890.0    20890.0  408143200
2019-10-27  21230.0  21480.0  21120.0  21320.0    21320.0  385354900
2019-11-03  21110.0  21350.0  20790.0  21050.0    21050.0  481923000
2019-11-10  20590.0  20820.0  20300.0  20650.0    20650.0  505488400
2019-11-17  20410.0  20700.0  20230.0  20560.0    20560.0  411505600
2019-11-24  20120.0  20310.0  19980.0  20180.0    20180.0  508736100
2019-12-01  19580.0  19810.0  19240.0  19440.0    19440.0  628877000

In [191]:
df_new=dfk

In [192]:
df.sort_index(inplace=True)
df=df.resample('D').sum() #====> mengisi data yang hilang
df.iloc[:,:5] = df.iloc[:,:5].replace(0, np.nan)
df.fillna(method='ffill')['2019-09']
# df.replace(0, np.nan, inplace=True)
# df.fillna(method='ffill')['2019-06']

              Open    High     Low   Close  Adj Close     Volume
Date
2019-09-01  4430.0  4450.0  4420.0  4450.0     4450.0          0
2019-09-02  4440.0  4450.0  4400.0  4410.0     4410.0   27531000
2019-09-03  4440.0  4440.0  4330.0  4350.0     4350.0   66884700
2019-09-04  4310.0  4350.0  4280.0  4290.0     4290.0   78905600
2019-09-05  4290.0  4360.0  4290.0  4320.0     4320.0   97098300
2019-09-06  4360.0  4360.0  4210.0  4210.0     4210.0  117223300
2019-09-07  4360.0  4360.0  4210.0  4210.0     4210.0          0
2019-09-08  4360.0  4360.0  4210.0  4210.0     4210.0          0
2019-09-09  4280.0  4300.0  4240.0  4270.0     4270.0   47057300
2019-09-10  4300.0  4300.0  4250.0  4270.0     4270.0   80403000
2019-09-11  4300.0  4300.0  4210.0  4250.0     4250.0   90211600
2019-09-12  4220.0  4230.0  4160.0  4170.0     4170.0   70382200
2019-09-13  4230.0  4230.0  4160.0  4160.0     4160.0   64074800
2019-09-14  4230.0  4230.0  4160.0  4160.0     4160.0          0
2019-09-15  4230.0  4230.0  4160.0  4160.0     4160.0          0
2019-09-16  4160.0  4260.0  4160.0  4220.0     4220.0   85284700
2019-09-17  4240.0  4280.0  4220.0  4270.0     4270.0   86432000
2019-09-18  4250.0  4280.0  4230.0  4250.0     4250.0   72359600
2019-09-19  4260.0  4260.0  4190.0  4210.0     4210.0   58720600
2019-09-20  4250.0  4300.0  4230.0  4290.0     4290.0  132359100
2019-09-21  4250.0  4300.0  4230.0  4290.0     4290.0          0
2019-09-22  4250.0  4300.0  4230.0  4290.0     4290.0          0
2019-09-23  4290.0  4300.0  4230.0  4250.0     4250.0   70483600
2019-09-24  4210.0  4240.0  4150.0  4210.0     4210.0   88979100
2019-09-25  4220.0  4250.0  4180.0  4220.0     4220.0   84582300
2019-09-26  4220.0  4370.0  4200.0  4360.0     4360.0   79324000
2019-09-27  4310.0  4350.0  4300.0  4310.0     4310.0   52305800
2019-09-28  4310.0  4350.0  4300.0  4310.0     4310.0          0
2019-09-29  4310.0  4350.0  4300.0  4310.0     4310.0          0
2019-09-30  4270.0  4330.0  4270.0  4310.0     4310.0  111879100

In [193]:
# how to handle missing date
# cari dates yang hilang
k=pd.date_range(start='2019-06', end='2019-12').difference(df.index)
k

DatetimeIndex(['2019-06-01', '2019-06-02', '2019-06-03', '2019-06-04'], dtype='datetime64[ns]', freq=None)

In [200]:
df_new.set_index('Date')
df.resample('W')